<template>
  <top-content></top-content>
  <text-content
    :imgRight="true"
    :imgSrc="'/src/assets/img/Rectangle14.png'"
    :text="textAlmaty"
  ></text-content>
  <div class="home-downlaod">
    <a href="../assets/Robert_Louis_Stevenson_-_Treasure_Island.pdf" download=""
      ><button class="home-download-btn">
        Скачать маршрут: Увлекательный маршрут по город

        <div class="home-pdf-icon">
          <svg
            width="64"
            height="64"
            viewBox="0 0 64 64"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16 0C13.8 0 12 1.8 12 4V60C12 62.2 13.8 64 16 64H56C58.2 64 60 62.2 60 60V16L44 0H16Z"
              fill="#E2E5E7"
            />
            <path d="M48 16H60L44 0V12C44 14.2 45.8 16 48 16Z" fill="#B0B7BD" />
            <path d="M60 28L48 16H60V28Z" fill="#CAD1D8" />
            <path
              d="M52 52C52 53.1 51.1 54 50 54H6C4.9 54 4 53.1 4 52V32C4 30.9 4.9 30 6 30H50C51.1 30 52 30.9 52 32V52Z"
              fill="#F15642"
            />
            <path
              d="M12.7178 37.894C12.7178 37.366 13.1338 36.79 13.8038 36.79H17.4978C19.5778 36.79 21.4498 38.182 21.4498 40.85C21.4498 43.378 19.5778 44.786 17.4978 44.786H14.8278V46.898C14.8278 47.602 14.3798 48 13.8038 48C13.2758 48 12.7178 47.602 12.7178 46.898V37.894ZM14.8278 38.804V42.788H17.4978C18.5698 42.788 19.4178 41.842 19.4178 40.85C19.4178 39.732 18.5698 38.804 17.4978 38.804H14.8278Z"
              fill="white"
            />
            <path
              d="M24.5815 48.0001C24.0535 48.0001 23.4775 47.7121 23.4775 47.0101V37.9261C23.4775 37.3521 24.0535 36.9341 24.5815 36.9341H28.2435C35.5515 36.9341 35.3915 48.0001 28.3875 48.0001H24.5815ZM25.5895 38.8861V46.0501H28.2435C32.5615 46.0501 32.7535 38.8861 28.2435 38.8861H25.5895Z"
              fill="white"
            />
            <path
              d="M37.9836 39.014V41.556H42.0616C42.6376 41.556 43.2136 42.132 43.2136 42.69C43.2136 43.218 42.6376 43.65 42.0616 43.65H37.9836V47.008C37.9836 47.568 37.5856 47.998 37.0256 47.998C36.3216 47.998 35.8916 47.568 35.8916 47.008V37.924C35.8916 37.35 36.3236 36.932 37.0256 36.932H42.6396C43.3436 36.932 43.7596 37.35 43.7596 37.924C43.7596 38.436 43.3436 39.012 42.6396 39.012H37.9836V39.014Z"
              fill="white"
            />
            <path
              d="M50 54H12V56H50C51.1 56 52 55.1 52 54V52C52 53.1 51.1 54 50 54Z"
              fill="#CAD1D8"
            />
          </svg>
        </div></button
    ></a>
  </div>
  <the-way :TitleWay="'Увлекательный маршрут по городу'"></the-way>
  <text-content
    :title="'текст с заголовком'"
    :imgRight="false"
    :imgSrc="'/src/assets/img/Rectangle14.png'"
    :text="textAlmaty"
  ></text-content>
</template>
<script>
import TextContent from "../components/TextContent/TextContent.vue";
import TopContent from "../components/TopContent/TopContent.vue";
import TheWay from "../components/TheWay/TheWay.vue";
export default {
  components: {
    TopContent,
    TextContent,
    TheWay,
  },
  data() {
    return {
      textAlmaty:
        "Немецкая история Верного – Алма-Аты – Алматы начинается буквально с момента основания города в 1854 г. С середины 19 в. здесь в молодом городе Туркестанского края жили и работали не только чиновники немецкого происхождения, но и немецкие ученые и путешественники: ботаник-натуралист А.Шренк, путешественник, врач и исследователь растительного мира Туркестанского края Иоганн-Альберт Регель, садовод К.Штольц, лесоводы братья Баум и другие. В советский период истории в нашем городе жили и работали немцы – представители творческой и научной интеллигенции, архитекторы, известные спортсмены, врачи и многие другие. Многие из них были депортированы в 1941 г. из различных мест проживания этнических немцев в СССР и расселены в разных областях Казахской ССР, а с ослаблением режима спецпоселения, когда появилась возможностью работать и учиться в столице Казахстана, переехали в Алма-Ату. Надеемся, что наша экскурсия поможет вам в осмыслении исторического прошлого своего народа и сохранении достойной памяти о нем!",
    };
  },
  computed: {},
};
</script>

<style>
.home-download-btn {
  max-width: 1216px;
  width: 100%;
  padding: 40px 0;
  background-color: #f5f5f5;
  border: 3px dashed #ab9995;
  border-radius: 30px;
  cursor: pointer;
  font-family: "Komika Title - Axis RUS-LAT";
  font-size: 18px;
  color: #5c5754;
  margin: 70px 0;
}
.home-downlaod {
  text-align: center;
}
.home-pdf-icon {
  position: absolute;
  top: 20px;
  right: 236px;
}
</style>
